
**<h1><span style="color:red"><u>Credit score calculations</u></span></h1>**
**Datascientest**

### <span style="color:yellow"> 0. Importation des librairies</span>

In [2]:
import pandas as pd

## <span style="color:red"> I. Audit des données</span>

In [24]:
df = pd.read_csv(filepath_or_buffer = 'test.csv',
                           sep = ',',
                           header = 0)

#print(df.columns)
print(df.head())

       ID Customer_ID      Month             Name  Age          SSN  \
0  0x160a   CUS_0xd40  September    Aaron Maashoh   23  821-00-0265
1  0x160b   CUS_0xd40    October    Aaron Maashoh   24  821-00-0265
2  0x160c   CUS_0xd40   November    Aaron Maashoh   24  821-00-0265
3  0x160d   CUS_0xd40   December    Aaron Maashoh  24_  821-00-0265
4  0x1616  CUS_0x21b1  September  Rick Rothackerj   28  004-07-5839

  Occupation Annual_Income  Monthly_Inhand_Salary  Num_Bank_Accounts  ...  \
0  Scientist      19114.12            1824.843333                  3  ...
1  Scientist      19114.12            1824.843333                  3  ...
2  Scientist      19114.12            1824.843333                  3  ...
3  Scientist      19114.12                    NaN                  3  ...
4    _______      34847.84            3037.986667                  2  ...

   Num_Credit_Inquiries  Credit_Mix Outstanding_Debt Credit_Utilization_Ratio  \
0                2022.0        Good           809.98                35.030402
1                   4.0        Good           809.98                33.053114
2                   4.0        Good           809.98                33.811894
3                   4.0        Good           809.98                32.430559
4                   5.0        Good           605.03                25.926822

       Credit_History_Age Payment_of_Min_Amount Total_EMI_per_month  \
0   22 Years and 9 Months                    No           49.574949
1  22 Years and 10 Months                    No           49.574949
2                     NaN                    No           49.574949
3   23 Years and 0 Months                    No           49.574949
4   27 Years and 3 Months                    No           18.816215

   Amount_invested_monthly                 Payment_Behaviour  \
0       236.64268203272135    Low_spent_Small_value_payments
1       21.465380264657146  High_spent_Medium_value_payments
2       148.23393788500925   Low_spent_Medium_value_payments
3        39.08251089460281  High_spent_Medium_value_payments
4       39.684018417945296   High_spent_Large_value_payments

      Monthly_Balance
0  186.26670208571772
1  361.44400385378196
2  264.67544623342997
3  343.82687322383634
4   485.2984336755923

[5 rows x 27 columns]

In [25]:
df.isna().sum()

ID                             0
Customer_ID                    0
Month                          0
Name                        5015
Age                            0
SSN                            0
Occupation                     0
Annual_Income                  0
Monthly_Inhand_Salary       7498
Num_Bank_Accounts              0
Num_Credit_Card                0
Interest_Rate                  0
Num_of_Loan                    0
Type_of_Loan                5704
Delay_from_due_date            0
Num_of_Delayed_Payment      3498
Changed_Credit_Limit           0
Num_Credit_Inquiries        1035
Credit_Mix                     0
Outstanding_Debt               0
Credit_Utilization_Ratio       0
Credit_History_Age          4470
Payment_of_Min_Amount          0
Total_EMI_per_month            0
Amount_invested_monthly     2271
Payment_Behaviour              0
Monthly_Balance              562
dtype: int64

In [26]:
df.shape

(50000, 27)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 27 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        50000 non-null  object
 1   Customer_ID               50000 non-null  object
 2   Month                     50000 non-null  object
 3   Name                      44985 non-null  object
 4   Age                       50000 non-null  object
 5   SSN                       50000 non-null  object
 6   Occupation                50000 non-null  object
 7   Annual_Income             50000 non-null  object
 8   Monthly_Inhand_Salary     42502 non-null  float64
 9   Num_Bank_Accounts         50000 non-null  int64
 10  Num_Credit_Card           50000 non-null  int64
 11  Interest_Rate             50000 non-null  int64
 12  Num_of_Loan               50000 non-null  object
 13  Type_of_Loan              44296 non-null  object
 14  Delay_from_due_date       50000 non-null  int64
 15  Num_of_Delayed_Payment    46502 non-null  object
 16  Changed_Credit_Limit      50000 non-null  object
 17  Num_Credit_Inquiries      48965 non-null  float64
 18  Credit_Mix                50000 non-null  object
 19  Outstanding_Debt          50000 non-null  object
 20  Credit_Utilization_Ratio  50000 non-null  float64
 21  Credit_History_Age        45530 non-null  object
 22  Payment_of_Min_Amount     50000 non-null  object
 23  Total_EMI_per_month       50000 non-null  float64
 24  Amount_invested_monthly   47729 non-null  object
 25  Payment_Behaviour         50000 non-null  object
 26  Monthly_Balance           49438 non-null  object
dtypes: float64(4), int64(4), object(19)
memory usage: 10.3+ MB

In [27]:
df.isnull().sum()

ID                             0
Customer_ID                    0
Month                          0
Name                        5015
Age                            0
SSN                            0
Occupation                     0
Annual_Income                  0
Monthly_Inhand_Salary       7498
Num_Bank_Accounts              0
Num_Credit_Card                0
Interest_Rate                  0
Num_of_Loan                    0
Type_of_Loan                5704
Delay_from_due_date            0
Num_of_Delayed_Payment      3498
Changed_Credit_Limit           0
Num_Credit_Inquiries        1035
Credit_Mix                     0
Outstanding_Debt               0
Credit_Utilization_Ratio       0
Credit_History_Age          4470
Payment_of_Min_Amount          0
Total_EMI_per_month            0
Amount_invested_monthly     2271
Payment_Behaviour              0
Monthly_Balance              562
dtype: int64

In [28]:
df.describe()

,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Delay_from_due_date,Num_Credit_Inquiries,Credit_Utilization_Ratio,Total_EMI_per_month
count,42502.000000,50000.000000,50000.000000,50000.000000,50000.000000,48965.000000,50000.000000,50000.000000
mean,4182.004291,16.838260,22.921480,68.772640,21.052640,30.080200,32.279581,1491.304305
std,3174.109304,116.396848,129.314804,451.602363,14.860397,196.984121,5.106238,8595.647887
min,303.645417,-1.000000,0.000000,1.000000,-5.000000,0.000000,20.509652,0.000000
25%,1625.188333,3.000000,4.000000,8.000000,10.000000,4.000000,28.061040,32.222388
50%,3086.305000,6.000000,5.000000,13.000000,18.000000,7.000000,32.280390,74.733349
75%,5934.189094,7.000000,7.000000,20.000000,28.000000,10.000000,36.468591,176.157491
max,15204.633333,1798.000000,1499.000000,5799.000000,67.000000,2593.000000,48.540663,82398.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 27 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        50000 non-null  object
 1   Customer_ID               50000 non-null  object
 2   Month                     50000 non-null  object
 3   Name                      44985 non-null  object
 4   Age                       50000 non-null  object
 5   SSN                       50000 non-null  object
 6   Occupation                50000 non-null  object
 7   Annual_Income             50000 non-null  object
 8   Monthly_Inhand_Salary     42502 non-null  float64
 9   Num_Bank_Accounts         50000 non-null  int64
 10  Num_Credit_Card           50000 non-null  int64
 11  Interest_Rate             50000 non-null  int64
 12  Num_of_Loan               50000 non-null  object
 13  Type_of_Loan              44296 non-null  object
 14  Delay_from_due_date       50000 non-null  int64
 15  Num_of_Delayed_Payment    46502 non-null  object
 16  Changed_Credit_Limit      50000 non-null  object
 17  Num_Credit_Inquiries      48965 non-null  float64
 18  Credit_Mix                50000 non-null  object
 19  Outstanding_Debt          50000 non-null  object
 20  Credit_Utilization_Ratio  50000 non-null  float64
 21  Credit_History_Age        45530 non-null  object
 22  Payment_of_Min_Amount     50000 non-null  object
 23  Total_EMI_per_month       50000 non-null  float64
 24  Amount_invested_monthly   47729 non-null  object
 25  Payment_Behaviour         50000 non-null  object
 26  Monthly_Balance           49438 non-null  object
dtypes: float64(4), int64(4), object(19)
memory usage: 10.3+ MB

In [9]:
df.describe() #la distribution des données

,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Delay_from_due_date,Num_Credit_Inquiries,Credit_Utilization_Ratio,Total_EMI_per_month
count,42502.000000,50000.000000,50000.000000,50000.000000,50000.000000,48965.000000,50000.000000,50000.000000
mean,4182.004291,16.838260,22.921480,68.772640,21.052640,30.080200,32.279581,1491.304305
std,3174.109304,116.396848,129.314804,451.602363,14.860397,196.984121,5.106238,8595.647887
min,303.645417,-1.000000,0.000000,1.000000,-5.000000,0.000000,20.509652,0.000000
25%,1625.188333,3.000000,4.000000,8.000000,10.000000,4.000000,28.061040,32.222388
50%,3086.305000,6.000000,5.000000,13.000000,18.000000,7.000000,32.280390,74.733349
75%,5934.189094,7.000000,7.000000,20.000000,28.000000,10.000000,36.468591,176.157491
max,15204.633333,1798.000000,1499.000000,5799.000000,67.000000,2593.000000,48.540663,82398.000000

In [56]:
print(df.duplicated().sum()) # On repère les lignes contenant des doublons

0

In [57]:
df = df.dropna(axis = 0, how = 'any') # On supprime toutes les lignes contenant au moins une valeur manquante

In [61]:
df.isna().sum(axis = 0) #les colonnes de transactions ne contiennent plus de valeurs manquantes

ID                          0
Customer_ID                 0
Month                       0
Name                        0
Age                         0
SSN                         0
Occupation                  0
Annual_Income               0
Monthly_Inhand_Salary       0
Num_Bank_Accounts           0
Num_Credit_Card             0
Interest_Rate               0
Num_of_Loan                 0
Type_of_Loan                0
Delay_from_due_date         0
Num_of_Delayed_Payment      0
Changed_Credit_Limit        0
Num_Credit_Inquiries        0
Credit_Mix                  0
Outstanding_Debt            0
Credit_Utilization_Ratio    0
Credit_History_Age          0
Payment_of_Min_Amount       0
Total_EMI_per_month         0
Amount_invested_monthly     0
Payment_Behaviour           0
Monthly_Balance             0
dtype: int64

In [66]:
len(df['ID'].unique())#ok

26459

In [67]:
len(df['Customer_ID'].unique()) #nok? ok?

10767

In [68]:
df['Month'].unique()#ok

array(['September', 'October', 'December', 'November'], dtype=object)

In [69]:
df['Name'] #ok

0          Aaron Maashoh
1          Aaron Maashoh
4        Rick Rothackerj
5        Rick Rothackerj
7        Rick Rothackerj
              ...
49992     Sarah McBridec
49993     Sarah McBridec
49994     Sarah McBridec
49997              Nicks
49999              Nicks
Name: Name, Length: 26459, dtype: object

In [ ]:
df['Age'].unique() # nok a traité

In [70]:
df['SSN'] #nok '#F%$D@*&8', ...,

0        821-00-0265
1        821-00-0265
4        004-07-5839
5          #F%$D@*&8
7        004-07-5839
            ...
49992    031-35-0942
49993    031-35-0942
49994    031-35-0942
49997    078-73-5990
49999    078-73-5990
Name: SSN, Length: 26459, dtype: object

In [71]:
df['Occupation'].unique() #nok '_______'

array(['Scientist', '_______', 'Teacher', 'Engineer', 'Entrepreneur',
       'Lawyer', 'Media_Manager', 'Doctor', 'Journalist', 'Mechanic',
       'Writer', 'Accountant', 'Architect', 'Manager', 'Musician',
       'Developer'], dtype=object)

In [72]:
df['Annual_Income'] #nok ? dtype: object, should be Float

0        19114.12
1        19114.12
4        34847.84
5        34847.84
7        34847.84
           ...
49992    20002.88
49993    20002.88
49994    20002.88
49997    39628.99
49999    39628.99
Name: Annual_Income, Length: 26459, dtype: object

In [76]:
df['Monthly_Inhand_Salary'] #ok Float

In [73]:
df['Num_Bank_Accounts'].unique() #ok, Integer

In [99]:
df['Num_Credit_Card'].unique() #nok valeurs = 0, Integer

array([   4,    5,    1,    7,    6,    8,    3,  211,  182,    9,   10,
        914,    2,  229,   11, 1365, 1289,  497,  181,  793,  517, 1084,
        488, 1438,  784, 1279, 1036, 1196, 1446,  510, 1171,  590, 1197,
        881,  167, 1427,  766, 1364,  513,  808,  863,  570, 1301, 1184,
       1037,  617,  547,  591, 1274, 1465,  954,   64, 1217,  667,  930,
        238,  554, 1499, 1271, 1266,  571, 1485, 1168,  330, 1052, 1250,
       1096,  101,  569,  885, 1435,  265,  546,   85,  298,  258,  533,
         51,    0,  705,  786,  217,  886,  408,  720,  633,  751,  524,
       1348,  574,  220,  393, 1462,  712,  476, 1127,  609, 1203, 1278,
       1323,  433, 1356,   19,  584,  455,  492,  750,  839,   54, 1392,
        757, 1063, 1245,  144,  702,  324,   59,  332,  293,  968,  981,
        697,  335,  725,  541,   26, 1375,  931, 1393,   30,  322,  338,
        204, 1220, 1242,  856,  121,  366,  168, 1495, 1210,  349,  555,
        299,   69, 1015,  199,  487,  142,   41,  883,   98,   81, 1045,
        974,  770,  174,  829,  384,  118, 1303,  256,  377, 1093, 1312,
       1329,  957,  877,  243,  820,  195,  724,  926,  933, 1070,  982,
        232, 1183,  237, 1080,  660,  721, 1206, 1020, 1315, 1450,  992,
        158,   31,  849,  715, 1498,  404,  460, 1150,  979,  392, 1156,
        231, 1058,  355,  362,  434,  683,  910,  421,  176,  135,  285,
        631,  147, 1405, 1261,  675,  834,  267, 1488,  897,  789,  964,
        650,  323,  868,  778,  733, 1013,  978,  516,  911, 1055,  203,
        367,  878, 1420,  405,  644,  788,  792, 1143, 1190,  145,  288,
       1263,  970, 1332, 1447,  802,  889,  477,  225,  400,  273, 1359,
        302, 1201,  333,  781, 1034,  198,  595,  760, 1133,  475,  728,
       1066, 1436,  224, 1461,  480, 1208,  316,  128,  192,  448, 1298,
        684,  620, 1445,  907,   75, 1240,  415,  577,  997,  681,  540,
       1448, 1267,  704,  966,  240,   79,  922,  818, 1389,  797,  936,
        796, 1474, 1253, 1308,   86,   96, 1071,   49, 1016,  677, 1238,
        632,  916,  116,  638,  503,  170,  879, 1159,  457,  398, 1258,
       1121,  732,  963,  708,  614, 1402,  122,  521, 1167,  314,  465,
       1132,  790, 1109, 1022, 1287,  665,  127,  166,  976,   47,  816,
       1374,   63,  924,  429, 1411, 1148,  531,  506,  313,  255,   99,
       1032,  310,   37, 1384,  178,  468, 1180, 1095,  864, 1255,  528,
       1126, 1089,  827,  519,  185, 1033,  647,  904,  115,  871, 1243,
        655,  402,  719,  923,  451,  626,  381,  832, 1431, 1091, 1188,
        304,  420,  711,  726, 1234,  205, 1221,  514,   95,  664,  807,
         77,  222,  114,   18,  769, 1281, 1223, 1026,  950,  350,  247,
        809, 1399, 1422,   22, 1101, 1352, 1186, 1466,  544, 1346,  903,
       1275, 1244,  657,  164,  347,  671,  599, 1151, 1386,  654,  835,
        777, 1041, 1219,  771, 1157,  763,  858, 1347, 1481, 1321,  873,
        100, 1372, 1241,  813,  431,  529,   73,  119,  251,  523, 1129,
        971,  774,  105,  729,  739,  718,  920,  745,  413,  586,  986,
        716,  618,  197,  860,  515,  406,  843,  983,  257,  592,  689,
        900, 1414,  481,  357,  426,   87,  163,  230,  692,  952, 1345,
       1319, 1380,  598, 1351,  542,   66,  241,  688, 1233, 1398,  615,
        417, 1209,  466, 1439, 1423,  955], dtype=int64)

In [79]:
df['Interest_Rate'].unique()  #ok, Integer

In [80]:
df['Num_of_Loan'].unique() #nok valeurs = '__'

array(['4', '1', '3', '-100', '2', '7', '5', '6', '5_', '8', '1_', '2_',
       '6_', '4_', '9', '965', '7_', '3_', '50', '8_', '495', '1018',
       '1470', '9_', '481_', '617', '1237', '602', '582', '1225', '1146',
       '286', '505', '335', '463', '864', '949', '720', '181', '1048',
       '814', '434', '77', '639', '336', '249', '106', '1073', '1259',
       '1365', '114', '810', '992', '1416', '1374', '746', '1487', '1147',
       '511', '198', '1140', '876', '569', '1221', '1040', '1496', '1063',
       '1428', '1361', '232', '653', '1448', '523', '426', '1068', '486',
       '1027', '359', '1108', '1471', '628', '1284', '1446', '35', '483',
       '928', '838', '1109', '1300', '1292', '547', '1385', '950', '1153',
       '539', '1240', '376', '1481', '1287', '325', '72_', '1024', '220',
       '478', '551', '1231', '1244', '140', '1329', '255', '326', '99',
       '1149', '142', '641', '97', '295', '1444', '790', '624', '659',
       '361', '813', '1095', '508', '879', '1373', '615', '1445', '612',
       '324', '531', '339', '1057', '343', '395', '1175', '663', '135',
       '910', '1447', '354', '477', '544', '204', '1369', '656', '534',
       '1292_', '1436', '939', '172', '1296_'], dtype=object)

In [82]:
df['Type_of_Loan'] #ok, String

0        Auto Loan, Credit-Builder Loan, Personal Loan,...
1        Auto Loan, Credit-Builder Loan, Personal Loan,...
4                                      Credit-Builder Loan
5                                      Credit-Builder Loan
7                                      Credit-Builder Loan
                               ...
49992    Personal Loan, Auto Loan, Mortgage Loan, Stude...
49993    Personal Loan, Auto Loan, Mortgage Loan, Stude...
49994    Personal Loan, Auto Loan, Mortgage Loan, Stude...
49997                          Auto Loan, and Student Loan
49999                          Auto Loan, and Student Loan
Name: Type_of_Loan, Length: 26459, dtype: object

In [83]:
df['Delay_from_due_date'].unique() #negative values, could be?

array([ 3,  6,  5,  0, 30, 11,  2, 16,  4, 10, 23,  8,  9, 51, 45, 48, 25,
       43, 22, 49, 55, 52, 61, 59, 31, 27, 18, 15, 53, 14, 12, 17,  7, 50,
       44, 13, 34, 54, 20, 28, 57, 62, 24, 56, 41, 37, 19, 29,  1, 64, 36,
       42, 60, 21, 33, 26, 38, 32, 35, 40, 46, 47, -1, 39, 66, -4, 58, -2,
       -3, 65, 63, -5, 67], dtype=int64)

In [84]:
df['Num_of_Delayed_Payment'].unique() #negative values, underscore values

array(['7', '9', '1', '3', '2_', '6', '8', '14', '12', '0', '19', '20',
       '2', '10', '13', '15', '1150', '18', '23', '21', '17', '22', '11',
       '5', '16', '11_', '15_', '4', '24', '10_', '9_', '25_', '17_',
       '0_', '429', '12_', '20_', '-2', '-1', '2806', '25', '2465',
       '4246', '1186', '75', '16_', '18_', '7_', '1134', '27', '26',
       '1230', '4318', '1_', '28', '1216', '24_', '3667', '420', '2606',
       '959', '14_', '22_', '19_', '1122', '21_', '3178', '-3', '13_',
       '3398', '-2_', '1486', '8_', '5_', '586', '873', '2801', '4_',
       '2503_', '3954', '376', '2354', '4343', '2279', '391', '1334',
       '6_', '1958', '2608', '1274', '452', '227_', '26_', '2161', '377',
       '762', '4161', '1544', '975_', '211', '518', '657', '3477', '370',
       '1534', '1080', '23_', '3057', '1065', '2819', '-3_', '1329', '3_',
       '-1_', '2273', '1266', '3684', '1802', '1880', '181', '3591',
       '1356', '2672', '2001', '4298', '590', '1095', '1562', '100',
       '3177', '2276', '4335', '2822', '832', '3529', '2942', '2802',
       '3393', '288', '2424', '345', '2269', '179', '1513', '4118',
       '3071', '700', '2836', '434', '2649', '1891', '2999', '2344_',
       '1437', '3898', '2568', '1633', '2431', '538', '864', '1297',
       '414', '4044', '427', '961', '952', '1571', '3863', '1832', '3425',
       '1069', '1959', '1990', '1166', '3565_', '2595', '2873', '599',
       '2286', '2018', '3589', '292', '2767', '1246', '652', '3744',
       '3229', '3520', '1014', '707', '2392', '817', '2148_', '297',
       '806', '3161', '1630', '2902', '4088', '2885', '1149', '1312',
       '2055_', '861', '3803', '2464', '3064', '1761', '4133', '3392_',
       '358', '2368', '2570', '3032', '828', '238', '3807', '1169',
       '1703', '2287', '688', '2348', '4214', '4026', '726', '3099',
       '2748', '2704', '2538', '3535', '1055', '1265', '1968', '3630',
       '1290', '1833', '2123', '1888', '502', '459', '2170', '2407',
       '3642', '4270', '3608', '1289', '2953', '3757', '2052', '4141',
       '883', '3794', '2410', '1514', '3633', '989', '3971', '3920',
       '1634', '481_', '97_', '225', '2346', '4313', '1889', '3622',
       '1779', '1619', '3406', '3594', '272', '3313', '3637', '174',
       '3240', '2450', '1970', '3913', '332', '2034'], dtype=object)

In [85]:
df['Changed_Credit_Limit'].unique() #nok object should be Float

array(['11.27', '13.27', '5.42', ..., '32.16', '25.16', '13.39'],
      dtype=object)

In [87]:
df['Num_Credit_Inquiries'] #ok Float

0        2022.0
1           4.0
4           5.0
5           5.0
7           5.0
          ...
49992       9.0
49993      12.0
49994      12.0
49997       7.0
49999       7.0
Name: Num_Credit_Inquiries, Length: 26459, dtype: float64

In [88]:
df['Credit_Mix'].unique() #nok '_'

array(['Good', '_', 'Standard', 'Bad'], dtype=object)

In [89]:
df['Outstanding_Debt'].unique() #nok object should be Float

array(['809.98', '605.03', '1303.01', ..., '620.64', '3571.7', '502.38'],
      dtype=object)

In [91]:
df['Credit_Utilization_Ratio'] #ok Float

0        35.030402
1        33.053114
4        25.926822
5        30.116600
7        33.875167
           ...
49992    32.391288
49993    37.528511
49994    27.027812
49997    36.858542
49999    34.108530
Name: Credit_Utilization_Ratio, Length: 26459, dtype: float64

In [92]:
df['Credit_History_Age'].unique() # need to trasforme

array(['22 Years and 9 Months', '22 Years and 10 Months',
       '27 Years and 3 Months', '27 Years and 4 Months',
       '27 Years and 6 Months', '18 Years and 6 Months',
       '17 Years and 11 Months', '18 Years and 0 Months',
       '18 Years and 1 Months', '18 Years and 2 Months',
       '31 Years and 4 Months', '31 Years and 5 Months',
       '15 Years and 3 Months', '15 Years and 6 Months',
       '22 Years and 0 Months', '22 Years and 1 Months',
       '27 Years and 1 Months', '27 Years and 2 Months',
       '19 Years and 10 Months', '20 Years and 0 Months',
       '26 Years and 2 Months', '27 Years and 7 Months',
       '9 Years and 8 Months', '18 Years and 11 Months',
       '19 Years and 0 Months', '19 Years and 1 Months',
       '17 Years and 6 Months', '17 Years and 8 Months',
       '17 Years and 9 Months', '7 Years and 1 Months',
       '7 Years and 3 Months', '18 Years and 10 Months',
       '10 Years and 9 Months', '10 Years and 10 Months',
       '10 Years and 11 Months', '11 Years and 0 Months',
       '12 Years and 11 Months', '13 Years and 0 Months',
       '13 Years and 1 Months', '18 Years and 8 Months',
       '18 Years and 9 Months', '14 Years and 4 Months',
       '14 Years and 5 Months', '14 Years and 6 Months',
       '14 Years and 7 Months', '20 Years and 1 Months',
       '30 Years and 11 Months', '31 Years and 1 Months',
       '31 Years and 2 Months', '9 Years and 4 Months',
       '9 Years and 6 Months', '19 Years and 5 Months',
       '19 Years and 7 Months', '19 Years and 8 Months',
       '9 Years and 5 Months', '9 Years and 7 Months',
       '13 Years and 9 Months', '13 Years and 10 Months',
       '13 Years and 11 Months', '22 Years and 2 Months',
       '22 Years and 4 Months', '26 Years and 3 Months',
       '26 Years and 4 Months', '14 Years and 0 Months',
       '28 Years and 8 Months', '28 Years and 10 Months',
       '8 Years and 7 Months', '8 Years and 8 Months',
       '8 Years and 9 Months', '24 Years and 11 Months',
       '25 Years and 0 Months', '25 Years and 1 Months',
       '25 Years and 2 Months', '1 Years and 10 Months',
       '2 Years and 0 Months', '2 Years and 1 Months',
       '11 Years and 7 Months', '11 Years and 8 Months',
       '11 Years and 9 Months', '11 Years and 10 Months',
       '31 Years and 3 Months', '31 Years and 6 Months',
       '11 Years and 1 Months', '11 Years and 2 Months',
       '11 Years and 3 Months', '11 Years and 4 Months',
       '14 Years and 9 Months', '21 Years and 4 Months',
       '21 Years and 7 Months', '1 Years and 1 Months',
       '1 Years and 2 Months', '32 Years and 5 Months',
       '32 Years and 6 Months', '17 Years and 7 Months',
       '13 Years and 2 Months', '13 Years and 3 Months',
       '13 Years and 4 Months', '13 Years and 6 Months',
       '12 Years and 3 Months', '25 Years and 4 Months',
       '25 Years and 5 Months', '25 Years and 7 Months',
       '13 Years and 5 Months', '19 Years and 9 Months',
       '19 Years and 11 Months', '31 Years and 9 Months',
       '32 Years and 0 Months', '5 Years and 10 Months',
       '5 Years and 11 Months', '6 Years and 0 Months',
       '6 Years and 1 Months', '3 Years and 9 Months',
       '3 Years and 10 Months', '17 Years and 1 Months',
       '17 Years and 2 Months', '17 Years and 3 Months',
       '23 Years and 7 Months', '23 Years and 8 Months',
       '23 Years and 10 Months', '9 Years and 2 Months',
       '9 Years and 3 Months', '31 Years and 7 Months',
       '5 Years and 1 Months', '5 Years and 2 Months',
       '5 Years and 4 Months', '33 Years and 6 Months',
       '33 Years and 7 Months', '12 Years and 10 Months',
       '17 Years and 10 Months', '13 Years and 7 Months',
       '13 Years and 8 Months', '30 Years and 5 Months',
       '26 Years and 5 Months', '33 Years and 8 Months',
       '33 Years and 9 Months', '26 Years and 10 Months',
       '27 Years and 0 Months', '18 Years and 5 Months',
       '8 Years and 1 Months', '8 Years and 2 Months',
       '12 Years and 1 Months', '29 Years and 0 Months',
       '29 Years and 1 Months', '29 Years and 2 Months',
       '29 Years and 11 Months', '30 Years and 1 Months',
       '31 Years and 0 Months', '14 Years and 1 Months',
       '14 Years and 2 Months', '2 Years and 2 Months',
       '2 Years and 3 Months', '33 Years and 11 Months',
       '26 Years and 8 Months', '29 Years and 5 Months',
       '29 Years and 6 Months', '29 Years and 7 Months',
       '29 Years and 8 Months', '5 Years and 5 Months',
       '5 Years and 6 Months', '32 Years and 3 Months',
       '33 Years and 5 Months', '6 Years and 7 Months',
       '6 Years and 8 Months', '17 Years and 0 Months',
       '22 Years and 5 Months', '22 Years and 6 Months',
       '20 Years and 10 Months', '20 Years and 11 Months',
       '21 Years and 1 Months', '21 Years and 0 Months',
       '21 Years and 2 Months', '3 Years and 0 Months',
       '3 Years and 1 Months', '3 Years and 2 Months',
       '2 Years and 4 Months', '16 Years and 0 Months',
       '16 Years and 2 Months', '16 Years and 3 Months',
       '16 Years and 11 Months', '31 Years and 8 Months',
       '9 Years and 10 Months', '9 Years and 11 Months',
       '10 Years and 0 Months', '10 Years and 1 Months',
       '27 Years and 9 Months', '28 Years and 0 Months',
       '28 Years and 6 Months', '28 Years and 7 Months',
       '19 Years and 2 Months', '19 Years and 3 Months',
       '25 Years and 3 Months', '8 Years and 10 Months',
       '6 Years and 3 Months', '6 Years and 4 Months',
       '17 Years and 4 Months', '17 Years and 5 Months',
       '27 Years and 5 Months', '12 Years and 5 Months',
       '12 Years and 6 Months', '12 Years and 7 Months',
       '12 Years and 8 Months', '26 Years and 7 Months',
       '32 Years and 2 Months', '23 Years and 5 Months',
       '16 Years and 7 Months', '16 Years and 8 Months',
       '16 Years and 9 Months', '18 Years and 7 Months',
       '31 Years and 10 Months', '15 Years and 2 Months',
       '15 Years and 4 Months', '16 Years and 6 Months',
       '23 Years and 1 Months', '23 Years and 3 Months',
       '23 Years and 9 Months', '23 Years and 11 Months',
       '24 Years and 0 Months', '8 Years and 11 Months',
       '9 Years and 0 Months', '9 Years and 9 Months',
       '6 Years and 5 Months', '19 Years and 6 Months',
       '25 Years and 9 Months', '20 Years and 2 Months',
       '20 Years and 3 Months', '26 Years and 0 Months',
       '15 Years and 11 Months', '16 Years and 1 Months',
       '19 Years and 4 Months', '28 Years and 4 Months',
       '28 Years and 5 Months', '32 Years and 7 Months',
       '32 Years and 8 Months', '32 Years and 9 Months',
       '32 Years and 10 Months', '7 Years and 7 Months',
       '7 Years and 8 Months', '7 Years and 9 Months',
       '16 Years and 4 Months', '16 Years and 5 Months',
       '21 Years and 11 Months', '26 Years and 9 Months',
       '26 Years and 11 Months', '15 Years and 5 Months',
       '15 Years and 7 Months', '15 Years and 8 Months',
       '15 Years and 9 Months', '21 Years and 9 Months',
       '21 Years and 10 Months', '30 Years and 7 Months',
       '30 Years and 9 Months', '7 Years and 11 Months',
       '8 Years and 0 Months', '33 Years and 4 Months',
       '22 Years and 11 Months', '23 Years and 0 Months',
       '26 Years and 6 Months', '28 Years and 9 Months',
       '10 Years and 5 Months', '10 Years and 8 Months',
       '14 Years and 8 Months', '29 Years and 3 Months',
       '29 Years and 4 Months', '2 Years and 11 Months',
       '6 Years and 2 Months', '24 Years and 4 Months',
       '24 Years and 6 Months', '24 Years and 7 Months',
       '3 Years and 4 Months', '3 Years and 7 Months',
       '15 Years and 0 Months', '10 Years and 2 Months',
       '29 Years and 10 Months', '30 Years and 0 Months',
       '12 Years and 2 Months', '23 Years and 2 Months',
       '18 Years and 3 Months', '16 Years and 10 Months',
       '8 Years and 3 Months', '8 Years and 4 Months',
       '8 Years and 5 Months', '8 Years and 6 Months',
       '24 Years and 3 Months', '24 Years and 5 Months',
       '20 Years and 5 Months', '28 Years and 1 Months',
       '6 Years and 9 Months', '6 Years and 10 Months',
       '14 Years and 3 Months', '9 Years and 1 Months',
       '25 Years and 8 Months', '25 Years and 10 Months',
       '27 Years and 8 Months', '30 Years and 2 Months',
       '28 Years and 11 Months', '30 Years and 3 Months',
       '0 Years and 10 Months', '11 Years and 6 Months',
       '7 Years and 10 Months', '22 Years and 3 Months',
       '33 Years and 0 Months', '30 Years and 8 Months',
       '23 Years and 4 Months', '3 Years and 11 Months',
       '4 Years and 0 Months', '4 Years and 1 Months',
       '26 Years and 1 Months', '7 Years and 0 Months',
       '20 Years and 6 Months', '20 Years and 7 Months',
       '20 Years and 8 Months', '11 Years and 5 Months',
       '12 Years and 9 Months', '11 Years and 11 Months',
       '12 Years and 0 Months', '14 Years and 11 Months',
       '15 Years and 1 Months', '22 Years and 7 Months',
       '22 Years and 8 Months', '18 Years and 4 Months',
       '21 Years and 8 Months', '1 Years and 6 Months',
       '1 Years and 7 Months', '24 Years and 9 Months',
       '24 Years and 10 Months', '25 Years and 6 Months',
       '28 Years and 3 Months', '25 Years and 11 Months',
       '5 Years and 0 Months', '5 Years and 3 Months',
       '7 Years and 2 Months', '7 Years and 4 Months',
       '31 Years and 11 Months', '32 Years and 1 Months',
       '4 Years and 7 Months', '4 Years and 10 Months',
       '20 Years and 4 Months', '7 Years and 6 Months',
       '12 Years and 4 Months', '27 Years and 11 Months',
       '28 Years and 2 Months', '21 Years and 6 Months',
       '23 Years and 6 Months', '2 Years and 7 Months',
       '10 Years and 4 Months', '10 Years and 6 Months',
       '10 Years and 7 Months', '2 Years and 5 Months',
       '2 Years and 8 Months', '30 Years and 4 Months',
       '30 Years and 6 Months', '29 Years and 9 Months',
       '33 Years and 10 Months', '6 Years and 6 Months',
       '2 Years and 6 Months', '21 Years and 3 Months',
       '32 Years and 11 Months', '20 Years and 9 Months',
       '5 Years and 9 Months', '15 Years and 10 Months',
       '21 Years and 5 Months', '10 Years and 3 Months',
       '14 Years and 10 Months', '1 Years and 11 Months',
       '33 Years and 1 Months', '33 Years and 2 Months',
       '1 Years and 3 Months', '1 Years and 5 Months',
       '27 Years and 10 Months', '24 Years and 8 Months',
       '32 Years and 4 Months', '30 Years and 10 Months',
       '4 Years and 3 Months', '24 Years and 1 Months',
       '24 Years and 2 Months', '1 Years and 9 Months',
       '5 Years and 8 Months', '2 Years and 10 Months',
       '3 Years and 3 Months', '1 Years and 8 Months',
       '4 Years and 4 Months', '4 Years and 5 Months',
       '2 Years and 9 Months', '6 Years and 11 Months',
       '1 Years and 4 Months', '0 Years and 11 Months',
       '4 Years and 9 Months', '4 Years and 11 Months',
       '1 Years and 0 Months', '3 Years and 5 Months',
       '3 Years and 6 Months', '33 Years and 3 Months',
       '3 Years and 8 Months', '7 Years and 5 Months',
       '5 Years and 7 Months', '4 Years and 2 Months',
       '4 Years and 6 Months', '4 Years and 8 Months',
       '34 Years and 0 Months'], dtype=object)

In [93]:
df['Payment_of_Min_Amount'].unique() #nok need to trasforme'NM'-->'No'

array(['No', 'NM', 'Yes'], dtype=object)

In [95]:
df['Total_EMI_per_month'] #ok Float

0        49.574949
1        49.574949
4        18.816215
5        18.816215
7        18.816215
           ...
49992    60.964772
49993    60.964772
49994    60.964772
49997    35.104023
49999    35.104023
Name: Total_EMI_per_month, Length: 26459, dtype: float64

In [96]:
df['Amount_invested_monthly'].unique() #nok trasforme '236.64268203272135' -> 236.64268203272135

array(['236.64268203272135', '21.465380264657146', '39.684018417945296',
       ..., '71.79442082882734', '50.84684680498023',
       '220.45787812168732'], dtype=object)

In [97]:
df['Payment_Behaviour'].unique() #nok '!@9#%8'

array(['Low_spent_Small_value_payments',
       'High_spent_Medium_value_payments',
       'High_spent_Large_value_payments',
       'Low_spent_Large_value_payments', '!@9#%8',
       'Low_spent_Medium_value_payments',
       'High_spent_Small_value_payments'], dtype=object)

In [98]:
df['Monthly_Balance'].unique() #nok trasforme '236.64268203272135' -> 236.64268203272135

array(['186.26670208571772', '361.44400385378196', '485.2984336755923',
       ..., '341.179047488264', '349.7263321025098', '360.37968260123847'],
      dtype=object)